configuration/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.ЗаявкаНаРазработку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомандаРазработчиков</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаStoryPoint</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПубликация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/InformationRegisters/ВидыЗадачФилиалов/ВидыЗадачФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВидыЗадачФилиалов</name>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НастройкиПользователя/НастройкиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователя</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекПользователя</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/ChartsOfCharacteristicTypes/ВидыНастроекПользователя/ВидыНастроекПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыНастроекПользователя</name>
  <type>
    <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ЮридическиеЛица</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.Продукты</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>EnumRef.ВидыПроцессов</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЗаполнениеДокументов</name>
      <description>Заполнение документов</description>
      <code>000000024</code>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>НастройкиОповещений</name>
      <description>Настройки оповещений</description>
      <code>000000001</code>
      </content>
      </content>
        </content>
      </content>
    </items>
    <items>
      <name>НачалоРаботы</name>
      <description>Начало работы</description>
      <code>000000025</code>
    </items>
  </predefined>
  <attributes>
    <name>ВариантГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйРеквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.ВидыНастроекПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСписокВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКакПодраздел</name>
    <comment>Истина - будет группа будет представлена подразделом. Ложь - будетотображена как группа с заголовком на родительской странице</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <comment>Текст подсказки, которая будет отображаться в виде контекстной подсказки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПерезапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВыбора</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыНастроекПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыФилиалов</name>
    <attributes>
      <name>ТипФилиала</name>
      <type>
        <types>EnumRef.ТипыФилиалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Documents/Задача/Forms/НастройкиБыстрогоСозданияЗадачи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаИзмененныхРеквизитов;

&НаКлиенте
Перем КэшВспомогательныхДанных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ИдентификаторФормы = ОбщегоНазначенияКлиентСервер.СтрУникальныйИдентификатор(УникальныйИдентификатор); 
	
	СформироватьЭлементыФормы();
	ЗаполнитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КэшВспомогательныхДанных = ПолучитьКэшВспомогательныхДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы  И ИменаИзмененныхРеквизитов.Количество() > 0 Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВопросСохраненияНастроек", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Есть несохраненные настройки, сохранить?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Обработчик события ПриИзмении для всех программно сгенерированных реквизитов
//
// Параметры:
//  Элемент	 - ПолеФормы	 - измененный элемент
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачалоВыбораГруппыЗаказчиков(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяРеквизитаНаправление = ПолноеИмяРеквизита("НаправлениеДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	ИмяРеквизитаСистема = ПолноеИмяРеквизита("СистемаДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	
	ОтфильтрованныеГруппыЗаказчиков = ПолучитьГруппыЗаказчиков(ЭтотОбъект[ИмяРеквизитаНаправление],
		ЭтотОбъект[ИмяРеквизитаСистема]);
	
	ИмяРеквизитаГруппаЗаказчиков = ПолноеИмяРеквизита("ГруппаЗаказчиковДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	ИнтерфейсПриложенияКлиент.ОткрытьФормуВыбораГруппыЗаказчиков(ЭтотОбъект, ОтфильтрованныеГруппыЗаказчиков,
		Элементы[ИмяРеквизитаГруппаЗаказчиков]);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОбработатьИзменениеРеквизитов();
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ГруппаЗаказчиковОбработкаВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИмяРеквизитаГруппаЗаказчиков = ПолноеИмяРеквизита("ГруппаЗаказчиковДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
		ЭтотОбъект[ИмяРеквизитаГруппаЗаказчиков] = Результат;
		ПриИзмененииРеквизитаФормы(Элементы[ИмяРеквизитаГруппаЗаказчиков]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭлементыФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНастроекПользователя.Ссылка КАК Ссылка,
	|	ВидыНастроекПользователя.Наименование КАК Наименование,
	|	ВидыНастроекПользователя.Подсказка КАК Подсказка,
	|	ВидыНастроекПользователя.ТипЗначения КАК ТипЗначения,
	|	ВидыНастроекПользователя.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	ПланВидовХарактеристик.ВидыНастроекПользователя КАК ВидыНастроекПользователя
	|ГДЕ
	|	НЕ ВидыНастроекПользователя.ПометкаУдаления
	|	И НЕ ВидыНастроекПользователя.Скрытый
	|	И ВидыНастроекПользователя.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.БыстроеСозданиеЗадачи)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСледования,
	|	Наименование";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ТаблицаРеквизитов = Результат.Выгрузить();
		
		СоздатьРеквизиты(ТаблицаРеквизитов);
		СоздатьЭлементы(ТаблицаРеквизитов);
	КонецЕсли;
		
КонецПроцедуры  

&НаСервере
Процедура СоздатьРеквизиты(ТаблицаРеквизитов)
	
	ДобавляемыеРеквизиты = Новый Массив;
	Типы = Новый Массив;
	
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
		
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитов Цикл
		СтрокаРеквизита.ИмяРеквизита = ПолноеИмяРеквизита(СтрокаРеквизита.ИмяПредопределенныхДанных, ИдентификаторФормы);
		
		Если ТипЗнч(СтрокаРеквизита.ТипЗначения) = Тип("Тип") Тогда  
			Типы.Очистить();
			Типы.Добавить(СтрокаРеквизита.ТипЗначения);
			СтрокаРеквизита.ТипЗначения = Новый ОписаниеТипов(Типы);
		КонецЕсли;
		
		НовыйРеквизит = Новый РеквизитФормы(СтрокаРеквизита.ИмяРеквизита, СтрокаРеквизита.ТипЗначения, , СтрокаРеквизита.Наименование);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	КонецЦикла;

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементы(ТаблицаРеквизитов)
	
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитов Цикл   
		
		Ссылка = СтрокаРеквизита.Ссылка;
		ГруппаРодитель = Элементы.ГруппаНастройки;
		
		НовыйЭлемент = Элементы.Добавить(СтрокаРеквизита.ИмяРеквизита, Тип("ПолеФормы"), ГруппаРодитель);
		НовыйЭлемент.ПутьКДанным = СтрокаРеквизита.ИмяРеквизита;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.КнопкаСоздания = Ложь;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;  
		НовыйЭлемент.Подсказка = СтрокаРеквизита.Подсказка;
		НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		
		Если Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.НаправлениеДляБыстрогоСозданияЗадачи Тогда
			ТаблицаНаправленийРолей = Пользователи.ТаблицаНаправленийРолейПользователя();
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(ТаблицаНаправленийРолей.СписокНаправлений.ВыгрузитьЗначения());
			
		ИначеЕсли Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.ЮрЛицоДляБыстрогоСозданияЗадачи Тогда
			НовыйЭлемент.Доступность = Ложь;
			
		ИначеЕсли Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.НазначениеДляБыстрогоСозданияЗадачи Тогда
			ОбщегоНазначения.ЗаполнитьСписокНазначений(НовыйЭлемент.СписокВыбора);
			
		ИначеЕсли Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.СистемаДляБыстрогоСозданияЗадачи
			ИЛИ Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.ПродуктДляБыстрогоСозданияЗадачи Тогда
				
			НовыйЭлемент.КнопкаВыбора = Истина;
			НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;

		ИначеЕсли Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.ГруппаЗаказчиковДляБыстрогоСозданияЗадачи Тогда
			НовыйЭлемент.КнопкаВыбора = Истина;
			НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
			НовыйЭлемент.РедактированиеТекста = Ложь;
			НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбораГруппыЗаказчиков");
			
		ИначеЕсли Ссылка = ПланыВидовХарактеристик.ВидыНастроекПользователя.ВидЗадачиДляБыстрогоСозданияЗадачи Тогда
			ВидыЗадач = РегистрыСведений.ВидыЗадачФилиалов.ПолучитьВидыЗадач(ПараметрыСеанса.Филиал);
			
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(ВидыЗадач);
			НовыйЭлемент.Видимость = (ВидыЗадач.Количество() <> 0);	
		КонецЕсли;  
		
		// Добавляем действие при изменении реквизита
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизитаФормы");
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНастроекПользователя.Ссылка КАК Ссылка,
	|	ВидыНастроекПользователя.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ПОМЕСТИТЬ ВсеВидыНастроек
	|ИЗ
	|	ПланВидовХарактеристик.ВидыНастроекПользователя КАК ВидыНастроекПользователя
	|ГДЕ
	|	НЕ ВидыНастроекПользователя.ЭтоГруппа
	|	И НЕ ВидыНастроекПользователя.ПометкаУдаления
	|	И НЕ ВидыНастроекПользователя.Скрытый
	|	И ВидыНастроекПользователя.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.БыстроеСозданиеЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНастроекПользователя.Ссылка КАК Ссылка,
	|	ВидыНастроекПользователя.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	НастройкиПользователя.Значение КАК Значение
	|ПОМЕСТИТЬ НастройкиПользователя
	|ИЗ
	|	РегистрСведений.НастройкиПользователя КАК НастройкиПользователя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВидыНастроекПользователя КАК ВидыНастроекПользователя
	|		ПО НастройкиПользователя.Настройка = ВидыНастроекПользователя.Ссылка
	|			И (НастройкиПользователя.Пользователь = &Пользователь)
	|			И (ВидыНастроекПользователя.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.БыстроеСозданиеЗадачи))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВидыНастроек.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЕСТЬNULL(НастройкиПользователя.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	|ИЗ
	|	ВсеВидыНастроек КАК ВсеВидыНастроек
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПользователя КАК НастройкиПользователя
	|		ПО ВсеВидыНастроек.Ссылка = НастройкиПользователя.Ссылка
	|";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		РаботаСНастройками.УстановитьЗначенияРеквизитам(ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
		
	ИмяРеквизитаНаправление = ПолноеИмяРеквизита("НаправлениеДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
		
	Если ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаНаправление]) Тогда
		ИмяРеквизитаЮрЛицо = ПолноеИмяРеквизита("ЮрЛицоДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
		Элементы[ИмяРеквизитаЮрЛицо].Доступность = Истина;
		
		ДанныеСписка = РаботаСНастройкамиВызовСервера.ПолучитьСписокВыбораЮридическихЛиц(ЭтотОбъект[ИмяРеквизитаНаправление]);
		
		Для Каждого ЭлементСписка Из ДанныеСписка Цикл
			Элементы[ИмяРеквизитаЮрЛицо].СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли;
	
	ИмяРеквизитаГруппаЗаказчиков = ПолноеИмяРеквизита("ГруппаЗаказчиковДляБыстрогоСозданияЗадачи", ИдентификаторФормы); 
	ИмяРеквизитаПродукт = ПолноеИмяРеквизита("ПродуктДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	
	ДоступностьГруппаЗаказчиков = НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаПродукт]);
	ДоступностьПродукт = НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаГруппаЗаказчиков]); 
	
	Элементы[ИмяРеквизитаГруппаЗаказчиков].Доступность = ДоступностьГруппаЗаказчиков;
	Элементы[ИмяРеквизитаПродукт].Доступность = ДоступностьПродукт;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ТипЭлемента = ТипЗнч(Элемент);
	Если ТипЭлемента = Тип("Строка") Тогда
		ИмяРеквизита = Элемент;
	Иначе
		ИмяРеквизита = Элемент.Имя;
	КонецЕсли;
	
	ДобавитьРеквизитВСписокИзмененных(ИмяРеквизита);
		
	Если СтрНачинаетсяС(ИмяРеквизита, "НаправлениеДляБыстрогоСозданияЗадачи") Тогда	
		ИмяРеквизитаЮрЛицо = ПолноеИмяРеквизита("ЮрЛицоДляБыстрогоСозданияЗадачи", ИдентификаторФормы); 

		ЭтотОбъект[ИмяРеквизитаЮрЛицо] = ПредопределенноеЗначение("Справочник.ЮридическиеЛица.ПустаяСсылка"); 
		ОбновитьСписокВыбораЮридическогоЛица();
		
		ПриИзмененииРеквизитаФормы(ИмяРеквизитаЮрЛицо);
	КонецЕсли;
	
	// Не должно быть возможности заполнить одновременно поля Продукт и Группа заказчиков.
	// Если был заполнен Продукт, то Группа заказчиков должна стать недоступной.
	// Если поле Продукт было очищено, то Группа заказчиков должна стать доступной.
	Если СтрНачинаетсяС(ИмяРеквизита, "ПродуктДляБыстрогоСозданияЗадачи") Тогда	
		ДоступностьГруппаЗаказчиков = НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]);
		ИмяРеквизитаГруппаЗаказчиков = ПолноеИмяРеквизита("ГруппаЗаказчиковДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
		Элементы[ИмяРеквизитаГруппаЗаказчиков].Доступность = ДоступностьГруппаЗаказчиков;
		ДобавитьРеквизитВСписокИзмененных(ИмяРеквизитаГруппаЗаказчиков);
	КонецЕсли; 
	
	// И наоборот: если Группа заказчиков заполнена, не должно быть возможности заполнить Продукт.
	Если СтрНачинаетсяС(ИмяРеквизита, "ГруппаЗаказчиковДляБыстрогоСозданияЗадачи") Тогда	
		ДоступностьПродукт = НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]);
		ИмяРеквизитаПродукт = ПолноеИмяРеквизита("ПродуктДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
		Элементы[ИмяРеквизитаПродукт].Доступность = ДоступностьПродукт;
		ДобавитьРеквизитВСписокИзмененных(ИмяРеквизитаПродукт);
	КонецЕсли;
		
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитВСписокИзмененных(ИмяРеквизита)  
	
	НайденныйЭлемент = ИменаИзмененныхРеквизитов.Найти(ИмяРеквизита);
	Если НайденныйЭлемент = Неопределено Тогда
		ИменаИзмененныхРеквизитов.Добавить(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораЮридическогоЛица()

	ИмяЭлементаНаправления = ПолноеИмяРеквизита("НаправлениеДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	ИмяЭлементаЮрЛица = ПолноеИмяРеквизита("ЮрЛицоДляБыстрогоСозданияЗадачи", ИдентификаторФормы);
	
	НаправлениеРазработки = ЭтотОбъект[ИмяЭлементаНаправления];	
	Элемент = Элементы.Найти(ИмяЭлементаЮрЛица);
	
	Если Элемент <> Неопределено Тогда
		ДанныеСписка = РаботаСНастройкамиВызовСервера.ПолучитьСписокВыбораЮридическихЛиц(НаправлениеРазработки);
		
		ЗаполнятьСписокВыбора = (ДанныеСписка.Количество() > 0);
		Элемент.Доступность = ЗаполнятьСписокВыбора;
		
		СписокВыбора = Элемент.СписокВыбора;
		СписокВыбора.Очистить();
		
		Если ЗаполнятьСписокВыбора Тогда
			Для Каждого ЭлементСписка Из ДанныеСписка Цикл
				СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
		КонецЕсли;
		
		ВыбранноеЮридическоеЛицо = ЭтотОбъект[ИмяЭлементаЮрЛица];
		НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(ВыбранноеЮридическоеЛицо);
		Если НайденныйЭлемент = Неопределено Тогда
			ЭтотОбъект[ИмяЭлементаЮрЛица] = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолноеИмяРеквизита(ИмяРеквизита, ИдентификаторФормы) 
	
	Возврат СтрШаблон("%1_%2", ИмяРеквизита, ИдентификаторФормы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВопросСохраненияНастроек(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьИзменениеРеквизитов();
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ИменаИзмененныхРеквизитов.Очистить();		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитов()
	
	Если ИменаИзмененныхРеквизитов.Количество() > 0 Тогда	
		НовыеЗначения = РаботаСНастройкамиКлиент.ПолучитьСохраняемыеНастройки(ЭтотОбъект, ИменаИзмененныхРеквизитов);
		
		Если НовыеЗначения.Количество() > 0 Тогда
			СохранитьНастройки(Пользователь, НовыеЗначения);
			ИменаИзмененныхРеквизитов.Очистить();
			Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьГруппыЗаказчиков(Знач Направление, Знач Система)
	
	Результат = Новый Массив;
	
	ЭлементНаправление = КэшВспомогательныхДанных.ГруппыЗаказчиков.Получить(Направление);
	                     
	Если ЭлементНаправление <> Неопределено Тогда
		ЭлементСистема = ЭлементНаправление.Получить(Система);
		
		Если ЭлементСистема <> Неопределено Тогда
			Результат = ЭлементСистема;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКэшВспомогательныхДанных()
		
	ВспомогательныеДанные = Новый Структура;
	
	ГруппыЗаказчиков = ИнтерфейсПриложения.ПолучитьСписокГруппЗаказчиков();
	ВспомогательныеДанные.Вставить("ГруппыЗаказчиков", ГруппыЗаказчиков);
		
	Возврат ВспомогательныеДанные;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройки(Знач Пользователь, Знач НовыеЗначения)
		
	Результат = Новый Структура("НастройкиСохранены, ТекстОшибки", Истина, "");

	Для Каждого СтруктураЗначения Из НовыеЗначения Цикл
		НастройкаСсылка = ПланыВидовХарактеристик.ВидыНастроекПользователя[СтруктураЗначения.ИмяНастройки];
		РегистрыСведений.НастройкиПользователя.СохранитьНастройку(Пользователь, НастройкаСсылка, СтруктураЗначения.Значение);
	КонецЦикла;
	
	Если НЕ Результат.НастройкиСохранены Тогда
		ЗаписьЖурналаРегистрации("НастройкиПользователя", УровеньЖурналаРегистрации.Ошибка,,, Результат.ТекстОшибки);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#Если ТонкийКлиент ИЛИ ВебКлиент Тогда

ИменаИзмененныхРеквизитов = Новый Массив;

#КонецЕсли

#КонецОбласти
